In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [2]:
import webbrowser
link = 'http://www.tiobe.com/tiobe-index/'
webbrowser.open(link)

True

In [3]:
df = pd.read_clipboard() #create a dataframe through clipboard, just copy the table from other page

In [4]:
df

   Jan 2020  Jan 2019  Change Programming Language  Ratings Change.1
0         1         1     NaN                 Java  16.896%   -0.01%
1         2         2     NaN                    C  15.773%   +2.44%
2         3         3     NaN               Python   9.704%   +1.41%
3         4         4     NaN                  C++   5.574%   -2.58%
4         5         7  change                   C#   5.349%   +2.07%
5         6         5  change    Visual Basic .NET   5.287%   -1.17%
6         7         6  change           JavaScript   2.451%   -0.85%
7         8         8     NaN                  PHP   2.405%   -0.28%
8         9        15  change                Swift   1.795%   +0.61%
9        10         9  change                  SQL   1.504%   -0.77%

In [5]:
type(df)

pandas.core.frame.DataFrame

In [6]:
#get the column name of data frame
df.columns

Index(['Jan 2020', 'Jan 2019', 'Change', 'Programming Language', 'Ratings',
       'Change.1'],
      dtype='object')

In [7]:
df.Ratings

0    16.896%
1    15.773%
2     9.704%
3     5.574%
4     5.349%
5     5.287%
6     2.451%
7     2.405%
8     1.795%
9     1.504%
Name: Ratings, dtype: object

In [10]:
df_new = DataFrame(df, columns = ['Programming Language','Jan 2019'])

In [12]:
df_new

  Programming Language  Jan 2019
0                 Java         1
1                    C         2
2               Python         3
3                  C++         4
4                   C#         7
5    Visual Basic .NET         5
6           JavaScript         6
7                  PHP         8
8                Swift        15
9                  SQL         9

In [13]:
df['Jan 2020'] #get specific column, data type will be series

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
Name: Jan 2020, dtype: int64

In [14]:
df_new = DataFrame(df, columns = ['Programming Language','Jan 2019', 'Jan 2018'])

In [15]:
df_new

  Programming Language  Jan 2019  Jan 2018
0                 Java         1       NaN
1                    C         2       NaN
2               Python         3       NaN
3                  C++         4       NaN
4                   C#         7       NaN
5    Visual Basic .NET         5       NaN
6           JavaScript         6       NaN
7                  PHP         8       NaN
8                Swift        15       NaN
9                  SQL         9       NaN

In [16]:
df_new['Jan 2018'] = range(0,10)

In [17]:
df_new

  Programming Language  Jan 2019  Jan 2018
0                 Java         1         0
1                    C         2         1
2               Python         3         2
3                  C++         4         3
4                   C#         7         4
5    Visual Basic .NET         5         5
6           JavaScript         6         6
7                  PHP         8         7
8                Swift        15         8
9                  SQL         9         9

In [18]:
df_new['Jan 2019'] = range(0,10)

In [20]:
df_new

  Programming Language  Jan 2019  Jan 2018
0                 Java         0         0
1                    C         1         1
2               Python         2         2
3                  C++         3         3
4                   C#         4         4
5    Visual Basic .NET         5         5
6           JavaScript         6         6
7                  PHP         7         7
8                Swift         8         8
9                  SQL         9         9

In [23]:
df_new['Jan 2018'] = pd.Series(np.arange(0,10))

In [24]:
df_new

  Programming Language  Jan 2019  Jan 2018
0                 Java         0         0
1                    C         1         1
2               Python         2         2
3                  C++         3         3
4                   C#         4         4
5    Visual Basic .NET         5         5
6           JavaScript         6         6
7                  PHP         7         7
8                Swift         8         8
9                  SQL         9         9

In [25]:
df_new['Jan 2018'] = pd.Series([100,200], index = [1,2])

In [27]:
df_new

  Programming Language  Jan 2019  Jan 2018
0                 Java         0       NaN
1                    C         1     100.0
2               Python         2     200.0
3                  C++         3       NaN
4                   C#         4       NaN
5    Visual Basic .NET         5       NaN
6           JavaScript         6       NaN
7                  PHP         7       NaN
8                Swift         8       NaN
9                  SQL         9       NaN

## Understand Series and DataFrame

In [28]:
data = {'Country': ['Belgium', 'India', 'Brazil'],
       'Capital': ['Brussels', 'New Delhi', 'Brasilia'],
       'Population': [11190846, 1303171035, 207847528]}

### Series

In [29]:
a1 = pd.Series(data['Country'])

In [30]:
a1

0    Belgium
1      India
2     Brazil
dtype: object

In [31]:
a1.values

array(['Belgium', 'India', 'Brazil'], dtype=object)

In [32]:
a1.index  #we can manually change the index

RangeIndex(start=0, stop=3, step=1)

In [33]:
s1 = pd.Series(data['Country'], index=['A','B','C'])

In [34]:
s1

A    Belgium
B      India
C     Brazil
dtype: object

### DataFrame

In [35]:
df1 = pd.DataFrame(data)

In [36]:
df1

   Country    Capital  Population
0  Belgium   Brussels    11190846
1    India  New Delhi  1303171035
2   Brazil   Brasilia   207847528

In [37]:
cou = df1['Country']

In [38]:
type(cou)

pandas.core.series.Series

In [39]:
df1.iterrows() # get each row from dataframe

In [41]:
for row in df1.iterrows():
    print(row), print(type(row)), print(len(row))

(0, Country        Belgium
Capital       Brussels
Population    11190846
Name: 0, dtype: object)
<class 'tuple'>
2
(1, Country            India
Capital        New Delhi
Population    1303171035
Name: 1, dtype: object)
<class 'tuple'>
2
(2, Country          Brazil
Capital        Brasilia
Population    207847528
Name: 2, dtype: object)
<class 'tuple'>
2

In [43]:
for row in df1.iterrows():
    print(type(row[0])), print(type(row[1]))
    break

<class 'int'>
<class 'pandas.core.series.Series'>

### So the dataframe is made with series, we can also use series to create a dataframe

In [44]:
df1

   Country    Capital  Population
0  Belgium   Brussels    11190846
1    India  New Delhi  1303171035
2   Brazil   Brasilia   207847528

In [45]:
data

{'Country': ['Belgium', 'India', 'Brazil'],
 'Capital': ['Brussels', 'New Delhi', 'Brasilia'],
 'Population': [11190846, 1303171035, 207847528]}

In [46]:
s1 = pd.Series(data['Capital'])

In [47]:
s2 = pd.Series(data['Country'])

In [48]:
s3 = pd.Series(data['Population'])

In [53]:
df_new = pd.DataFrame([s1,s2,s3])

In [54]:
df_new #The row and column is different, we need to transpose the dataframe

          0           1          2
0  Brussels   New Delhi   Brasilia
1   Belgium       India     Brazil
2  11190846  1303171035  207847528

In [55]:
df_new = pd.DataFrame([s1,s2,s3], index=['Capital','Country','Population'])

In [56]:
df_new

                   0           1          2
Capital     Brussels   New Delhi   Brasilia
Country      Belgium       India     Brazil
Population  11190846  1303171035  207847528

In [57]:
df_new = df_new.T

In [58]:
df_new

     Capital  Country  Population
0   Brussels  Belgium    11190846
1  New Delhi    India  1303171035
2   Brasilia   Brazil   207847528

Series:  
Index: value 

DataFrame:  
Index: Value1 Value2 Value3